Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32CM5112GC00100_DFP/component/sercom.h
#define SERCOM_USART_CTRLB_CHSIZE_Pos         _UINT32_(0)                                          /* (SERCOM_USART_CTRLB) Character Size Position */
#define SERCOM_USART_CTRLB_CHSIZE_Msk         (_UINT32_(0x7) << SERCOM_USART_CTRLB_CHSIZE_Pos)     /* (SERCOM_USART_CTRLB) Character Size Mask */
#define SERCOM_USART_CTRLB_CHSIZE(value)      (SERCOM_USART_CTRLB_CHSIZE_Msk & (_UINT32_(value) << SERCOM_USART_CTRLB_CHSIZE_Pos)) /* Assignment of value for CHSIZE in the SERCOM_USART_CTRLB register */
#define   SERCOM_USART_CTRLB_CHSIZE_8BITS_Val _UINT32_(0x0)                                        /* (SERCOM_USART_CTRLB) 8-bits character  */
#define   SERCOM_USART_CTRLB_CHSIZE_9BITS_Val _UINT32_(0x1)                                        /* (SERCOM_USART_CTRLB) 9-bits character  */
#define   SERCOM_USART_CTRLB_CHSIZE_5BITS_Val _UINT32_(0x5)                                        /* (SERCOM_USART_CTRLB) 5-bits character  */
#define   SERCOM_USART_CTRLB_CHSIZE_6BITS_Val _UINT32_(0x6)                                        /* (SERCOM_USART_CTRLB) 6-bits character  */
#define   SERCOM_USART_CTRLB_CHSIZE_7BITS_Val _UINT32_(0x7)                                        /* (SERCOM_USART_CTRLB) 7-bits character  */
#define SERCOM_USART_CTRLB_CHSIZE_8BITS       (SERCOM_USART_CTRLB_CHSIZE_8BITS_Val << SERCOM_USART_CTRLB_CHSIZE_Pos) /* (SERCOM_USART_CTRLB) 8-bits character Position */
#define SERCOM_USART_CTRLB_CHSIZE_9BITS       (SERCOM_USART_CTRLB_CHSIZE_9BITS_Val << SERCOM_USART_CTRLB_CHSIZE_Pos) /* (SERCOM_USART_CTRLB) 9-bits character Position */
#define SERCOM_USART_CTRLB_CHSIZE_5BITS       (SERCOM_USART_CTRLB_CHSIZE_5BITS_Val << SERCOM_USART_CTRLB_CHSIZE_Pos) /* (SERCOM_USART_CTRLB) 5-bits character Position */
#define SERCOM_USART_CTRLB_CHSIZE_6BITS       (SERCOM_USART_CTRLB_CHSIZE_6BITS_Val << SERCOM_USART_CTRLB_CHSIZE_Pos) /* (SERCOM_USART_CTRLB) 6-bits character Position */
#define SERCOM_USART_CTRLB_CHSIZE_7BITS       (SERCOM_USART_CTRLB_CHSIZE_7BITS_Val << SERCOM_USART_CTRLB_CHSIZE_Pos) /* (SERCOM_USART_CTRLB) 7-bits character Position */
#define SERCOM_USART_CTRLB_SBMODE_Pos         _UINT32_(6)                                          /* (SERCOM_USART_CTRLB) Stop Bit Mode Position */
#define SERCOM_USART_CTRLB_SBMODE_Msk         (_UINT32_(0x1) << SERCOM_USART_CTRLB_SBMODE_Pos)     /* (SERCOM_USART_CTRLB) Stop Bit Mode Mask */
#define SERCOM_USART_CTRLB_SBMODE(value)      (SERCOM_USART_CTRLB_SBMODE_Msk & (_UINT32_(value) << SERCOM_USART_CTRLB_SBMODE_Pos)) /* Assignment of value for SBMODE in the SERCOM_USART_CTRLB register */
#define   SERCOM_USART_CTRLB_SBMODE_ONE_Val   _UINT32_(0x0)                                        /* (SERCOM_USART_CTRLB) One stop bit  */
#define   SERCOM_USART_CTRLB_SBMODE_TWO_Val   _UINT32_(0x1)                                        /* (SERCOM_USART_CTRLB) Two stop bits  */
#define SERCOM_USART_CTRLB_SBMODE_ONE         (SERCOM_USART_CTRLB_SBMODE_ONE_Val << SERCOM_USART_CTRLB_SBMODE_Pos) /* (SERCOM_USART_CTRLB) One stop bit Position */
#define SERCOM_USART_CTRLB_SBMODE_TWO         (SERCOM_USART_CTRLB_SBMODE_TWO_Val << SERCOM_USART_CTRLB_SBMODE_Pos) /* (SERCOM_USART_CTRLB) Two stop bits Position */
#define SERCOM_USART_CTRLB_COLDEN_Pos         _UINT32_(8)                                          /* (SERCOM_USART_CTRLB) Collision Detection Enable Position */
#define SERCOM_USART_CTRLB_COLDEN_Msk         (_UINT32_(0x1) << SERCOM_USART_CTRLB_COLDEN_Pos)     /* (SERCOM_USART_CTRLB) Collision Detection Enable Mask */
#define SERCOM_USART_CTRLB_COLDEN(value)      (SERCOM_USART_CTRLB_COLDEN_Msk & (_UINT32_(value) << SERCOM_USART_CTRLB_COLDEN_Pos)) /* Assignment of value for COLDEN in the SERCOM_USART_CTRLB register */
#define SERCOM_USART_CTRLB_SFDE_Pos           _UINT32_(9)                                          /* (SERCOM_USART_CTRLB) Start of Frame Detection Enable Position */
#define SERCOM_USART_CTRLB_SFDE_Msk           (_UINT32_(0x1) << SERCOM_USART_CTRLB_SFDE_Pos)       /* (SERCOM_USART_CTRLB) Start of Frame Detection Enable Mask */
#define SERCOM_USART_CTRLB_SFDE(value)        (SERCOM_USART_CTRLB_SFDE_Msk & (_UINT32_(value) << SERCOM_USART_CTRLB_SFDE_Pos)) /* Assignment of value for SFDE in the SERCOM_USART_CTRLB register */
#define SERCOM_USART_CTRLB_ENC_Pos            _UINT32_(10)                                         /* (SERCOM_USART_CTRLB) Encoding Format Position */
#define SERCOM_USART_CTRLB_ENC_Msk            (_UINT32_(0x1) << SERCOM_USART_CTRLB_ENC_Pos)        /* (SERCOM_USART_CTRLB) Encoding Format Mask */
#define SERCOM_USART_CTRLB_ENC(value)         (SERCOM_USART_CTRLB_ENC_Msk & (_UINT32_(value) << SERCOM_USART_CTRLB_ENC_Pos)) /* Assignment of value for ENC in the SERCOM_USART_CTRLB register */
#define   SERCOM_USART_CTRLB_ENC_DISABLE_Val  _UINT32_(0x0)                                        /* (SERCOM_USART_CTRLB) Data is not encoded  */
#define   SERCOM_USART_CTRLB_ENC_IRDA_Val     _UINT32_(0x1)                                        /* (SERCOM_USART_CTRLB) Data is IrDA encoded  */
#define SERCOM_USART_CTRLB_ENC_DISABLE        (SERCOM_USART_CTRLB_ENC_DISABLE_Val << SERCOM_USART_CTRLB_ENC_Pos) /* (SERCOM_USART_CTRLB) Data is not encoded Position */
#define SERCOM_USART_CTRLB_ENC_IRDA           (SERCOM_USART_CTRLB_ENC_IRDA_Val << SERCOM_USART_CTRLB_ENC_Pos) /* (SERCOM_USART_CTRLB) Data is IrDA encoded Position */
#define SERCOM_USART_CTRLB_PMODE_Pos          _UINT32_(13)                                         /* (SERCOM_USART_CTRLB) Parity Mode Position */
#define SERCOM_USART_CTRLB_PMODE_Msk          (_UINT32_(0x1) << SERCOM_USART_CTRLB_PMODE_Pos)      /* (SERCOM_USART_CTRLB) Parity Mode Mask */
#define SERCOM_USART_CTRLB_PMODE(value)       (SERCOM_USART_CTRLB_PMODE_Msk & (_UINT32_(value) << SERCOM_USART_CTRLB_PMODE_Pos)) /* Assignment of value for PMODE in the SERCOM_USART_CTRLB register */
#define   SERCOM_USART_CTRLB_PMODE_EVEN_Val   _UINT32_(0x0)                                        /* (SERCOM_USART_CTRLB) Even parity  */
#define   SERCOM_USART_CTRLB_PMODE_ODD_Val    _UINT32_(0x1)                                        /* (SERCOM_USART_CTRLB) Odd parity  */
#define SERCOM_USART_CTRLB_PMODE_EVEN         (SERCOM_USART_CTRLB_PMODE_EVEN_Val << SERCOM_USART_CTRLB_PMODE_Pos) /* (SERCOM_USART_CTRLB) Even parity Position */
#define SERCOM_USART_CTRLB_PMODE_ODD          (SERCOM_USART_CTRLB_PMODE_ODD_Val << SERCOM_USART_CTRLB_PMODE_Pos) /* (SERCOM_USART_CTRLB) Odd parity Position */
#define SERCOM_USART_CTRLB_TXEN_Pos           _UINT32_(16)                                         /* (SERCOM_USART_CTRLB) Transmitter Enable Position */
#define SERCOM_USART_CTRLB_TXEN_Msk           (_UINT32_(0x1) << SERCOM_USART_CTRLB_TXEN_Pos)       /* (SERCOM_USART_CTRLB) Transmitter Enable Mask */
#define SERCOM_USART_CTRLB_TXEN(value)        (SERCOM_USART_CTRLB_TXEN_Msk & (_UINT32_(value) << SERCOM_USART_CTRLB_TXEN_Pos)) /* Assignment of value for TXEN in the SERCOM_USART_CTRLB register */
#define SERCOM_USART_CTRLB_RXEN_Pos           _UINT32_(17)                                         /* (SERCOM_USART_CTRLB) Receiver Enable Position */
#define SERCOM_USART_CTRLB_RXEN_Msk           (_UINT32_(0x1) << SERCOM_USART_CTRLB_RXEN_Pos)       /* (SERCOM_USART_CTRLB) Receiver Enable Mask */
#define SERCOM_USART_CTRLB_RXEN(value)        (SERCOM_USART_CTRLB_RXEN_Msk & (_UINT32_(value) << SERCOM_USART_CTRLB_RXEN_Pos)) /* Assignment of value for RXEN in the SERCOM_USART_CTRLB register */
#define SERCOM_USART_CTRLB_FIFOCLR_Pos        _UINT32_(22)                                         /* (SERCOM_USART_CTRLB) FIFO Clear Position */
#define SERCOM_USART_CTRLB_FIFOCLR_Msk        (_UINT32_(0x3) << SERCOM_USART_CTRLB_FIFOCLR_Pos)    /* (SERCOM_USART_CTRLB) FIFO Clear Mask */
#define SERCOM_USART_CTRLB_FIFOCLR(value)     (SERCOM_USART_CTRLB_FIFOCLR_Msk & (_UINT32_(value) << SERCOM_USART_CTRLB_FIFOCLR_Pos)) /* Assignment of value for FIFOCLR in the SERCOM_USART_CTRLB register */
#define   SERCOM_USART_CTRLB_FIFOCLR_NONE_Val _UINT32_(0x0)                                        /* (SERCOM_USART_CTRLB) No action  */
#define   SERCOM_USART_CTRLB_FIFOCLR_TXFIFO_Val _UINT32_(0x1)                                        /* (SERCOM_USART_CTRLB) Clear TX FIFO  */
#define   SERCOM_USART_CTRLB_FIFOCLR_RXFIFO_Val _UINT32_(0x2)                                        /* (SERCOM_USART_CTRLB) Clear RX FIFO  */
#define   SERCOM_USART_CTRLB_FIFOCLR_BOTH_Val _UINT32_(0x3)                                        /* (SERCOM_USART_CTRLB) Clear both TX and RF FIFOs  */
#define SERCOM_USART_CTRLB_FIFOCLR_NONE       (SERCOM_USART_CTRLB_FIFOCLR_NONE_Val << SERCOM_USART_CTRLB_FIFOCLR_Pos) /* (SERCOM_USART_CTRLB) No action Position */
#define SERCOM_USART_CTRLB_FIFOCLR_TXFIFO     (SERCOM_USART_CTRLB_FIFOCLR_TXFIFO_Val << SERCOM_USART_CTRLB_FIFOCLR_Pos) /* (SERCOM_USART_CTRLB) Clear TX FIFO Position */
#define SERCOM_USART_CTRLB_FIFOCLR_RXFIFO     (SERCOM_USART_CTRLB_FIFOCLR_RXFIFO_Val << SERCOM_USART_CTRLB_FIFOCLR_Pos) /* (SERCOM_USART_CTRLB) Clear RX FIFO Position */
#define SERCOM_USART_CTRLB_FIFOCLR_BOTH       (SERCOM_USART_CTRLB_FIFOCLR_BOTH_Val << SERCOM_USART_CTRLB_FIFOCLR_Pos) /* (SERCOM_USART_CTRLB) Clear both TX and RF FIFOs Position */
#define SERCOM_USART_CTRLB_LINCMD_Pos         _UINT32_(24)                                         /* (SERCOM_USART_CTRLB) LIN Command Position */
#define SERCOM_USART_CTRLB_LINCMD_Msk         (_UINT32_(0x3) << SERCOM_USART_CTRLB_LINCMD_Pos)     /* (SERCOM_USART_CTRLB) LIN Command Mask */
#define SERCOM_USART_CTRLB_LINCMD(value)      (SERCOM_USART_CTRLB_LINCMD_Msk & (_UINT32_(value) << SERCOM_USART_CTRLB_LINCMD_Pos)) /* Assignment of value for LINCMD in the SERCOM_USART_CTRLB register */
#define   SERCOM_USART_CTRLB_LINCMD_NONE_Val  _UINT32_(0x0)                                        /* (SERCOM_USART_CTRLB) Normal USART transmission  */
#define   SERCOM_USART_CTRLB_LINCMD_SOFTWARE_CONTROL_TRANSMIT_CMD_Val _UINT32_(0x1)                                        /* (SERCOM_USART_CTRLB) Break field is transmitted when DATA is written  */
#define   SERCOM_USART_CTRLB_LINCMD_AUTO_TRANSMIT_CMD_Val _UINT32_(0x2)                                        /* (SERCOM_USART_CTRLB) Break, synch and identifier are automaticcaly transmitted when DATA is written with the identifier  */
#define SERCOM_USART_CTRLB_LINCMD_NONE        (SERCOM_USART_CTRLB_LINCMD_NONE_Val << SERCOM_USART_CTRLB_LINCMD_Pos) /* (SERCOM_USART_CTRLB) Normal USART transmission Position */
#define SERCOM_USART_CTRLB_LINCMD_SOFTWARE_CONTROL_TRANSMIT_CMD (SERCOM_USART_CTRLB_LINCMD_SOFTWARE_CONTROL_TRANSMIT_CMD_Val << SERCOM_USART_CTRLB_LINCMD_Pos) /* (SERCOM_USART_CTRLB) Break field is transmitted when DATA is written Position */
#define SERCOM_USART_CTRLB_LINCMD_AUTO_TRANSMIT_CMD (SERCOM_USART_CTRLB_LINCMD_AUTO_TRANSMIT_CMD_Val << SERCOM_USART_CTRLB_LINCMD_Pos) /* (SERCOM_USART_CTRLB) Break, synch and identifier are automaticcaly transmitted when DATA is written with the identifier Position */
#define SERCOM_USART_CTRLB_Msk                _UINT32_(0x03C32747)                                 /* (SERCOM_USART_CTRLB) Register Mask  */


/* -------- SERCOM_I2CM_CTRLC : (SERCOM Offset: 0x08) (R/W 32) I2CM Control C -------- */
#define SERCOM_I2CM_CTRLC_RESETVALUE          _UINT32_(0x00)                                       /*  (SERCOM_I2CM_CTRLC) I2CM Control C  Reset Value */

