Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32CM5112GC00100_DFP/component/sercom.h
/* -------- SERCOM_USART_CTRLC : (SERCOM Offset: 0x08) (R/W 32) USART Control C -------- */
#define SERCOM_USART_CTRLC_RESETVALUE         _UINT32_(0x00)                                       /*  (SERCOM_USART_CTRLC) USART Control C  Reset Value */

#define SERCOM_USART_CTRLC_GTIME_Pos          _UINT32_(0)                                          /* (SERCOM_USART_CTRLC) Guard Time Position */
#define SERCOM_USART_CTRLC_GTIME_Msk          (_UINT32_(0x7) << SERCOM_USART_CTRLC_GTIME_Pos)      /* (SERCOM_USART_CTRLC) Guard Time Mask */
#define SERCOM_USART_CTRLC_GTIME(value)       (SERCOM_USART_CTRLC_GTIME_Msk & (_UINT32_(value) << SERCOM_USART_CTRLC_GTIME_Pos)) /* Assignment of value for GTIME in the SERCOM_USART_CTRLC register */
#define SERCOM_USART_CTRLC_BRKLEN_Pos         _UINT32_(8)                                          /* (SERCOM_USART_CTRLC) LIN Master Break Length Position */
#define SERCOM_USART_CTRLC_BRKLEN_Msk         (_UINT32_(0x3) << SERCOM_USART_CTRLC_BRKLEN_Pos)     /* (SERCOM_USART_CTRLC) LIN Master Break Length Mask */
#define SERCOM_USART_CTRLC_BRKLEN(value)      (SERCOM_USART_CTRLC_BRKLEN_Msk & (_UINT32_(value) << SERCOM_USART_CTRLC_BRKLEN_Pos)) /* Assignment of value for BRKLEN in the SERCOM_USART_CTRLC register */
#define   SERCOM_USART_CTRLC_BRKLEN_13BITS_Val _UINT32_(0x0)                                        /* (SERCOM_USART_CTRLC) Break field transmission is 13 bit times  */
#define   SERCOM_USART_CTRLC_BRKLEN_17BITS_Val _UINT32_(0x1)                                        /* (SERCOM_USART_CTRLC) Break field transmission is 17 bit times  */
#define   SERCOM_USART_CTRLC_BRKLEN_21BITS_Val _UINT32_(0x2)                                        /* (SERCOM_USART_CTRLC) Break field transmission is 21 bit times  */
#define   SERCOM_USART_CTRLC_BRKLEN_26BITS_Val _UINT32_(0x3)                                        /* (SERCOM_USART_CTRLC) Break field transmission is 26 bit times  */
#define SERCOM_USART_CTRLC_BRKLEN_13BITS      (SERCOM_USART_CTRLC_BRKLEN_13BITS_Val << SERCOM_USART_CTRLC_BRKLEN_Pos) /* (SERCOM_USART_CTRLC) Break field transmission is 13 bit times Position */
#define SERCOM_USART_CTRLC_BRKLEN_17BITS      (SERCOM_USART_CTRLC_BRKLEN_17BITS_Val << SERCOM_USART_CTRLC_BRKLEN_Pos) /* (SERCOM_USART_CTRLC) Break field transmission is 17 bit times Position */
#define SERCOM_USART_CTRLC_BRKLEN_21BITS      (SERCOM_USART_CTRLC_BRKLEN_21BITS_Val << SERCOM_USART_CTRLC_BRKLEN_Pos) /* (SERCOM_USART_CTRLC) Break field transmission is 21 bit times Position */
#define SERCOM_USART_CTRLC_BRKLEN_26BITS      (SERCOM_USART_CTRLC_BRKLEN_26BITS_Val << SERCOM_USART_CTRLC_BRKLEN_Pos) /* (SERCOM_USART_CTRLC) Break field transmission is 26 bit times Position */
#define SERCOM_USART_CTRLC_HDRDLY_Pos         _UINT32_(10)                                         /* (SERCOM_USART_CTRLC) LIN Master Header Delay Position */
#define SERCOM_USART_CTRLC_HDRDLY_Msk         (_UINT32_(0x3) << SERCOM_USART_CTRLC_HDRDLY_Pos)     /* (SERCOM_USART_CTRLC) LIN Master Header Delay Mask */
#define SERCOM_USART_CTRLC_HDRDLY(value)      (SERCOM_USART_CTRLC_HDRDLY_Msk & (_UINT32_(value) << SERCOM_USART_CTRLC_HDRDLY_Pos)) /* Assignment of value for HDRDLY in the SERCOM_USART_CTRLC register */
#define   SERCOM_USART_CTRLC_HDRDLY_1BIT_Val  _UINT32_(0x0)                                        /* (SERCOM_USART_CTRLC) Delay between break and sync transmission is 1-bit time  */
#define   SERCOM_USART_CTRLC_HDRDLY_4BITS_Val _UINT32_(0x1)                                        /* (SERCOM_USART_CTRLC) Delay between break and sync transmission is 4-bit time  */
#define   SERCOM_USART_CTRLC_HDRDLY_8BITS_Val _UINT32_(0x2)                                        /* (SERCOM_USART_CTRLC) Delay between break and sync transmission is 8-bit time  */
#define   SERCOM_USART_CTRLC_HDRDLY_14BITS_Val _UINT32_(0x3)                                        /* (SERCOM_USART_CTRLC) Delay between break and sync transmission is 14-bit time  */
#define SERCOM_USART_CTRLC_HDRDLY_1BIT        (SERCOM_USART_CTRLC_HDRDLY_1BIT_Val << SERCOM_USART_CTRLC_HDRDLY_Pos) /* (SERCOM_USART_CTRLC) Delay between break and sync transmission is 1-bit time Position */
#define SERCOM_USART_CTRLC_HDRDLY_4BITS       (SERCOM_USART_CTRLC_HDRDLY_4BITS_Val << SERCOM_USART_CTRLC_HDRDLY_Pos) /* (SERCOM_USART_CTRLC) Delay between break and sync transmission is 4-bit time Position */
#define SERCOM_USART_CTRLC_HDRDLY_8BITS       (SERCOM_USART_CTRLC_HDRDLY_8BITS_Val << SERCOM_USART_CTRLC_HDRDLY_Pos) /* (SERCOM_USART_CTRLC) Delay between break and sync transmission is 8-bit time Position */
#define SERCOM_USART_CTRLC_HDRDLY_14BITS      (SERCOM_USART_CTRLC_HDRDLY_14BITS_Val << SERCOM_USART_CTRLC_HDRDLY_Pos) /* (SERCOM_USART_CTRLC) Delay between break and sync transmission is 14-bit time Position */
#define SERCOM_USART_CTRLC_INACK_Pos          _UINT32_(16)                                         /* (SERCOM_USART_CTRLC) Inhibit Not Acknowledge Position */
#define SERCOM_USART_CTRLC_INACK_Msk          (_UINT32_(0x1) << SERCOM_USART_CTRLC_INACK_Pos)      /* (SERCOM_USART_CTRLC) Inhibit Not Acknowledge Mask */
#define SERCOM_USART_CTRLC_INACK(value)       (SERCOM_USART_CTRLC_INACK_Msk & (_UINT32_(value) << SERCOM_USART_CTRLC_INACK_Pos)) /* Assignment of value for INACK in the SERCOM_USART_CTRLC register */
#define SERCOM_USART_CTRLC_DSNACK_Pos         _UINT32_(17)                                         /* (SERCOM_USART_CTRLC) Disable Successive NACK Position */
#define SERCOM_USART_CTRLC_DSNACK_Msk         (_UINT32_(0x1) << SERCOM_USART_CTRLC_DSNACK_Pos)     /* (SERCOM_USART_CTRLC) Disable Successive NACK Mask */
#define SERCOM_USART_CTRLC_DSNACK(value)      (SERCOM_USART_CTRLC_DSNACK_Msk & (_UINT32_(value) << SERCOM_USART_CTRLC_DSNACK_Pos)) /* Assignment of value for DSNACK in the SERCOM_USART_CTRLC register */
#define SERCOM_USART_CTRLC_MAXITER_Pos        _UINT32_(20)                                         /* (SERCOM_USART_CTRLC) Maximum Iterations Position */
#define SERCOM_USART_CTRLC_MAXITER_Msk        (_UINT32_(0x7) << SERCOM_USART_CTRLC_MAXITER_Pos)    /* (SERCOM_USART_CTRLC) Maximum Iterations Mask */
#define SERCOM_USART_CTRLC_MAXITER(value)     (SERCOM_USART_CTRLC_MAXITER_Msk & (_UINT32_(value) << SERCOM_USART_CTRLC_MAXITER_Pos)) /* Assignment of value for MAXITER in the SERCOM_USART_CTRLC register */
#define SERCOM_USART_CTRLC_DATA32B_Pos        _UINT32_(24)                                         /* (SERCOM_USART_CTRLC) Data 32 Bit Position */
#define SERCOM_USART_CTRLC_DATA32B_Msk        (_UINT32_(0x3) << SERCOM_USART_CTRLC_DATA32B_Pos)    /* (SERCOM_USART_CTRLC) Data 32 Bit Mask */
#define SERCOM_USART_CTRLC_DATA32B(value)     (SERCOM_USART_CTRLC_DATA32B_Msk & (_UINT32_(value) << SERCOM_USART_CTRLC_DATA32B_Pos)) /* Assignment of value for DATA32B in the SERCOM_USART_CTRLC register */
#define SERCOM_USART_CTRLC_FIFOEN_Pos         _UINT32_(27)                                         /* (SERCOM_USART_CTRLC) FIFO Enable Position */
#define SERCOM_USART_CTRLC_FIFOEN_Msk         (_UINT32_(0x1) << SERCOM_USART_CTRLC_FIFOEN_Pos)     /* (SERCOM_USART_CTRLC) FIFO Enable Mask */
#define SERCOM_USART_CTRLC_FIFOEN(value)      (SERCOM_USART_CTRLC_FIFOEN_Msk & (_UINT32_(value) << SERCOM_USART_CTRLC_FIFOEN_Pos)) /* Assignment of value for FIFOEN in the SERCOM_USART_CTRLC register */
#define SERCOM_USART_CTRLC_RXTRHOLD_Pos       _UINT32_(28)                                         /* (SERCOM_USART_CTRLC) Receive FIFO Threshold Position */
#define SERCOM_USART_CTRLC_RXTRHOLD_Msk       (_UINT32_(0x3) << SERCOM_USART_CTRLC_RXTRHOLD_Pos)   /* (SERCOM_USART_CTRLC) Receive FIFO Threshold Mask */
#define SERCOM_USART_CTRLC_RXTRHOLD(value)    (SERCOM_USART_CTRLC_RXTRHOLD_Msk & (_UINT32_(value) << SERCOM_USART_CTRLC_RXTRHOLD_Pos)) /* Assignment of value for RXTRHOLD in the SERCOM_USART_CTRLC register */
#define   SERCOM_USART_CTRLC_RXTRHOLD_DEFAULT_Val _UINT32_(0x0)                                        /* (SERCOM_USART_CTRLC) Interrupt and DMA triggers are generated when DATA is present in the FIFO  */
#define   SERCOM_USART_CTRLC_RXTRHOLD_HALF_Val _UINT32_(0x1)                                        /* (SERCOM_USART_CTRLC) Interrupt and DMA triggers are generated when FIFO is half-full  */
#define   SERCOM_USART_CTRLC_RXTRHOLD_FULL_Val _UINT32_(0x2)                                        /* (SERCOM_USART_CTRLC) Interrupt and DMA triggers are generated when FIFO is full  */
#define SERCOM_USART_CTRLC_RXTRHOLD_DEFAULT   (SERCOM_USART_CTRLC_RXTRHOLD_DEFAULT_Val << SERCOM_USART_CTRLC_RXTRHOLD_Pos) /* (SERCOM_USART_CTRLC) Interrupt and DMA triggers are generated when DATA is present in the FIFO Position */
#define SERCOM_USART_CTRLC_RXTRHOLD_HALF      (SERCOM_USART_CTRLC_RXTRHOLD_HALF_Val << SERCOM_USART_CTRLC_RXTRHOLD_Pos) /* (SERCOM_USART_CTRLC) Interrupt and DMA triggers are generated when FIFO is half-full Position */
#define SERCOM_USART_CTRLC_RXTRHOLD_FULL      (SERCOM_USART_CTRLC_RXTRHOLD_FULL_Val << SERCOM_USART_CTRLC_RXTRHOLD_Pos) /* (SERCOM_USART_CTRLC) Interrupt and DMA triggers are generated when FIFO is full Position */
#define SERCOM_USART_CTRLC_TXTRHOLD_Pos       _UINT32_(30)                                         /* (SERCOM_USART_CTRLC) Transmit FIFO Threshold Position */
#define SERCOM_USART_CTRLC_TXTRHOLD_Msk       (_UINT32_(0x3) << SERCOM_USART_CTRLC_TXTRHOLD_Pos)   /* (SERCOM_USART_CTRLC) Transmit FIFO Threshold Mask */
#define SERCOM_USART_CTRLC_TXTRHOLD(value)    (SERCOM_USART_CTRLC_TXTRHOLD_Msk & (_UINT32_(value) << SERCOM_USART_CTRLC_TXTRHOLD_Pos)) /* Assignment of value for TXTRHOLD in the SERCOM_USART_CTRLC register */
#define   SERCOM_USART_CTRLC_TXTRHOLD_DEFAULT_Val _UINT32_(0x0)                                        /* (SERCOM_USART_CTRLC) Interrupt and DMA triggers are generated as long as the FIFO is not full  */
#define   SERCOM_USART_CTRLC_TXTRHOLD_HALF_Val _UINT32_(0x1)                                        /* (SERCOM_USART_CTRLC) Interrupt and DMA triggers are generated when half FIFO space is free  */
#define   SERCOM_USART_CTRLC_TXTRHOLD_EMPTY_Val _UINT32_(0x2)                                        /* (SERCOM_USART_CTRLC) Interrupt and DMA triggers are generated when the FIFO is empty  */
#define SERCOM_USART_CTRLC_TXTRHOLD_DEFAULT   (SERCOM_USART_CTRLC_TXTRHOLD_DEFAULT_Val << SERCOM_USART_CTRLC_TXTRHOLD_Pos) /* (SERCOM_USART_CTRLC) Interrupt and DMA triggers are generated as long as the FIFO is not full Position */
#define SERCOM_USART_CTRLC_TXTRHOLD_HALF      (SERCOM_USART_CTRLC_TXTRHOLD_HALF_Val << SERCOM_USART_CTRLC_TXTRHOLD_Pos) /* (SERCOM_USART_CTRLC) Interrupt and DMA triggers are generated when half FIFO space is free Position */
#define SERCOM_USART_CTRLC_TXTRHOLD_EMPTY     (SERCOM_USART_CTRLC_TXTRHOLD_EMPTY_Val << SERCOM_USART_CTRLC_TXTRHOLD_Pos) /* (SERCOM_USART_CTRLC) Interrupt and DMA triggers are generated when the FIFO is empty Position */
#define SERCOM_USART_CTRLC_Msk                _UINT32_(0xFB730F07)                                 /* (SERCOM_USART_CTRLC) Register Mask  */


/* -------- SERCOM_I2CM_BAUD : (SERCOM Offset: 0x0C) (R/W 32) I2CM Baud Rate -------- */
#define SERCOM_I2CM_BAUD_RESETVALUE           _UINT32_(0x00)                                       /*  (SERCOM_I2CM_BAUD) I2CM Baud Rate  Reset Value */

#define SERCOM_I2CM_BAUD_BAUD_Pos             _UINT32_(0)                                          /* (SERCOM_I2CM_BAUD) Baud Rate Value Position */
#define SERCOM_I2CM_BAUD_BAUD_Msk             (_UINT32_(0xFF) << SERCOM_I2CM_BAUD_BAUD_Pos)        /* (SERCOM_I2CM_BAUD) Baud Rate Value Mask */
#define SERCOM_I2CM_BAUD_BAUD(value)          (SERCOM_I2CM_BAUD_BAUD_Msk & (_UINT32_(value) << SERCOM_I2CM_BAUD_BAUD_Pos)) /* Assignment of value for BAUD in the SERCOM_I2CM_BAUD register */
#define SERCOM_I2CM_BAUD_BAUDLOW_Pos          _UINT32_(8)                                          /* (SERCOM_I2CM_BAUD) Baud Rate Value Low Position */
#define SERCOM_I2CM_BAUD_BAUDLOW_Msk          (_UINT32_(0xFF) << SERCOM_I2CM_BAUD_BAUDLOW_Pos)     /* (SERCOM_I2CM_BAUD) Baud Rate Value Low Mask */
#define SERCOM_I2CM_BAUD_BAUDLOW(value)       (SERCOM_I2CM_BAUD_BAUDLOW_Msk & (_UINT32_(value) << SERCOM_I2CM_BAUD_BAUDLOW_Pos)) /* Assignment of value for BAUDLOW in the SERCOM_I2CM_BAUD register */
#define SERCOM_I2CM_BAUD_HSBAUD_Pos           _UINT32_(16)                                         /* (SERCOM_I2CM_BAUD) High Speed Baud Rate Value Position */
#define SERCOM_I2CM_BAUD_HSBAUD_Msk           (_UINT32_(0xFF) << SERCOM_I2CM_BAUD_HSBAUD_Pos)      /* (SERCOM_I2CM_BAUD) High Speed Baud Rate Value Mask */
#define SERCOM_I2CM_BAUD_HSBAUD(value)        (SERCOM_I2CM_BAUD_HSBAUD_Msk & (_UINT32_(value) << SERCOM_I2CM_BAUD_HSBAUD_Pos)) /* Assignment of value for HSBAUD in the SERCOM_I2CM_BAUD register */
#define SERCOM_I2CM_BAUD_HSBAUDLOW_Pos        _UINT32_(24)                                         /* (SERCOM_I2CM_BAUD) High Speed Baud Rate Value Low Position */
#define SERCOM_I2CM_BAUD_HSBAUDLOW_Msk        (_UINT32_(0xFF) << SERCOM_I2CM_BAUD_HSBAUDLOW_Pos)   /* (SERCOM_I2CM_BAUD) High Speed Baud Rate Value Low Mask */
#define SERCOM_I2CM_BAUD_HSBAUDLOW(value)     (SERCOM_I2CM_BAUD_HSBAUDLOW_Msk & (_UINT32_(value) << SERCOM_I2CM_BAUD_HSBAUDLOW_Pos)) /* Assignment of value for HSBAUDLOW in the SERCOM_I2CM_BAUD register */
#define SERCOM_I2CM_BAUD_Msk                  _UINT32_(0xFFFFFFFF)                                 /* (SERCOM_I2CM_BAUD) Register Mask  */


/* -------- SERCOM_SPI_BAUD : (SERCOM Offset: 0x0C) (R/W 8) SPI Baud Rate -------- */
#define SERCOM_SPI_BAUD_RESETVALUE            _UINT8_(0x00)                                        /*  (SERCOM_SPI_BAUD) SPI Baud Rate  Reset Value */

#define SERCOM_SPI_BAUD_BAUD_Pos              _UINT8_(0)                                           /* (SERCOM_SPI_BAUD) Baud Rate Value Position */
#define SERCOM_SPI_BAUD_BAUD_Msk              (_UINT8_(0xFF) << SERCOM_SPI_BAUD_BAUD_Pos)          /* (SERCOM_SPI_BAUD) Baud Rate Value Mask */
#define SERCOM_SPI_BAUD_BAUD(value)           (SERCOM_SPI_BAUD_BAUD_Msk & (_UINT8_(value) << SERCOM_SPI_BAUD_BAUD_Pos)) /* Assignment of value for BAUD in the SERCOM_SPI_BAUD register */
#define SERCOM_SPI_BAUD_Msk                   _UINT8_(0xFF)                                        /* (SERCOM_SPI_BAUD) Register Mask  */


/* -------- SERCOM_USART_BAUD : (SERCOM Offset: 0x0C) (R/W 16) USART Baud Rate -------- */
#define SERCOM_USART_BAUD_RESETVALUE          _UINT16_(0x00)                                       /*  (SERCOM_USART_BAUD) USART Baud Rate  Reset Value */

