Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32CM5112GC00100_DFP/component/sercom.h
/* -------- SERCOM_I2CM_INTENSET : (SERCOM Offset: 0x16) (R/W 8) I2CM Interrupt Enable Set -------- */
#define SERCOM_I2CM_INTENSET_RESETVALUE       _UINT8_(0x00)                                        /*  (SERCOM_I2CM_INTENSET) I2CM Interrupt Enable Set  Reset Value */

#define SERCOM_I2CM_INTENSET_MB_Pos           _UINT8_(0)                                           /* (SERCOM_I2CM_INTENSET) Master On Bus Interrupt Enable Position */
#define SERCOM_I2CM_INTENSET_MB_Msk           (_UINT8_(0x1) << SERCOM_I2CM_INTENSET_MB_Pos)        /* (SERCOM_I2CM_INTENSET) Master On Bus Interrupt Enable Mask */
#define SERCOM_I2CM_INTENSET_MB(value)        (SERCOM_I2CM_INTENSET_MB_Msk & (_UINT8_(value) << SERCOM_I2CM_INTENSET_MB_Pos)) /* Assignment of value for MB in the SERCOM_I2CM_INTENSET register */
#define SERCOM_I2CM_INTENSET_SB_Pos           _UINT8_(1)                                           /* (SERCOM_I2CM_INTENSET) Slave On Bus Interrupt Enable Position */
#define SERCOM_I2CM_INTENSET_SB_Msk           (_UINT8_(0x1) << SERCOM_I2CM_INTENSET_SB_Pos)        /* (SERCOM_I2CM_INTENSET) Slave On Bus Interrupt Enable Mask */
#define SERCOM_I2CM_INTENSET_SB(value)        (SERCOM_I2CM_INTENSET_SB_Msk & (_UINT8_(value) << SERCOM_I2CM_INTENSET_SB_Pos)) /* Assignment of value for SB in the SERCOM_I2CM_INTENSET register */
#define SERCOM_I2CM_INTENSET_TXFE_Pos         _UINT8_(3)                                           /* (SERCOM_I2CM_INTENSET) Tx FIFO Empty Interrupt Enable Position */
#define SERCOM_I2CM_INTENSET_TXFE_Msk         (_UINT8_(0x1) << SERCOM_I2CM_INTENSET_TXFE_Pos)      /* (SERCOM_I2CM_INTENSET) Tx FIFO Empty Interrupt Enable Mask */
#define SERCOM_I2CM_INTENSET_TXFE(value)      (SERCOM_I2CM_INTENSET_TXFE_Msk & (_UINT8_(value) << SERCOM_I2CM_INTENSET_TXFE_Pos)) /* Assignment of value for TXFE in the SERCOM_I2CM_INTENSET register */
#define SERCOM_I2CM_INTENSET_RXFF_Pos         _UINT8_(4)                                           /* (SERCOM_I2CM_INTENSET) Rx FIFO Full Interrupt Enable Position */
#define SERCOM_I2CM_INTENSET_RXFF_Msk         (_UINT8_(0x1) << SERCOM_I2CM_INTENSET_RXFF_Pos)      /* (SERCOM_I2CM_INTENSET) Rx FIFO Full Interrupt Enable Mask */
#define SERCOM_I2CM_INTENSET_RXFF(value)      (SERCOM_I2CM_INTENSET_RXFF_Msk & (_UINT8_(value) << SERCOM_I2CM_INTENSET_RXFF_Pos)) /* Assignment of value for RXFF in the SERCOM_I2CM_INTENSET register */
#define SERCOM_I2CM_INTENSET_ERROR_Pos        _UINT8_(7)                                           /* (SERCOM_I2CM_INTENSET) Combined Error Interrupt Enable Position */
#define SERCOM_I2CM_INTENSET_ERROR_Msk        (_UINT8_(0x1) << SERCOM_I2CM_INTENSET_ERROR_Pos)     /* (SERCOM_I2CM_INTENSET) Combined Error Interrupt Enable Mask */
#define SERCOM_I2CM_INTENSET_ERROR(value)     (SERCOM_I2CM_INTENSET_ERROR_Msk & (_UINT8_(value) << SERCOM_I2CM_INTENSET_ERROR_Pos)) /* Assignment of value for ERROR in the SERCOM_I2CM_INTENSET register */
#define SERCOM_I2CM_INTENSET_Msk              _UINT8_(0x9B)                                        /* (SERCOM_I2CM_INTENSET) Register Mask  */


/* -------- SERCOM_I2CS_INTENSET : (SERCOM Offset: 0x16) (R/W 8) I2CS Interrupt Enable Set -------- */
#define SERCOM_I2CS_INTENSET_RESETVALUE       _UINT8_(0x00)                                        /*  (SERCOM_I2CS_INTENSET) I2CS Interrupt Enable Set  Reset Value */

#define SERCOM_I2CS_INTENSET_PREC_Pos         _UINT8_(0)                                           /* (SERCOM_I2CS_INTENSET) Stop Received Interrupt Enable Position */
#define SERCOM_I2CS_INTENSET_PREC_Msk         (_UINT8_(0x1) << SERCOM_I2CS_INTENSET_PREC_Pos)      /* (SERCOM_I2CS_INTENSET) Stop Received Interrupt Enable Mask */
#define SERCOM_I2CS_INTENSET_PREC(value)      (SERCOM_I2CS_INTENSET_PREC_Msk & (_UINT8_(value) << SERCOM_I2CS_INTENSET_PREC_Pos)) /* Assignment of value for PREC in the SERCOM_I2CS_INTENSET register */
#define SERCOM_I2CS_INTENSET_AMATCH_Pos       _UINT8_(1)                                           /* (SERCOM_I2CS_INTENSET) Address Match Interrupt Enable Position */
#define SERCOM_I2CS_INTENSET_AMATCH_Msk       (_UINT8_(0x1) << SERCOM_I2CS_INTENSET_AMATCH_Pos)    /* (SERCOM_I2CS_INTENSET) Address Match Interrupt Enable Mask */
#define SERCOM_I2CS_INTENSET_AMATCH(value)    (SERCOM_I2CS_INTENSET_AMATCH_Msk & (_UINT8_(value) << SERCOM_I2CS_INTENSET_AMATCH_Pos)) /* Assignment of value for AMATCH in the SERCOM_I2CS_INTENSET register */
#define SERCOM_I2CS_INTENSET_DRDY_Pos         _UINT8_(2)                                           /* (SERCOM_I2CS_INTENSET) Data Interrupt Enable Position */
#define SERCOM_I2CS_INTENSET_DRDY_Msk         (_UINT8_(0x1) << SERCOM_I2CS_INTENSET_DRDY_Pos)      /* (SERCOM_I2CS_INTENSET) Data Interrupt Enable Mask */
#define SERCOM_I2CS_INTENSET_DRDY(value)      (SERCOM_I2CS_INTENSET_DRDY_Msk & (_UINT8_(value) << SERCOM_I2CS_INTENSET_DRDY_Pos)) /* Assignment of value for DRDY in the SERCOM_I2CS_INTENSET register */
#define SERCOM_I2CS_INTENSET_TXFE_Pos         _UINT8_(3)                                           /* (SERCOM_I2CS_INTENSET) Tx FIFO Empty Interrupt Enable Position */
#define SERCOM_I2CS_INTENSET_TXFE_Msk         (_UINT8_(0x1) << SERCOM_I2CS_INTENSET_TXFE_Pos)      /* (SERCOM_I2CS_INTENSET) Tx FIFO Empty Interrupt Enable Mask */
#define SERCOM_I2CS_INTENSET_TXFE(value)      (SERCOM_I2CS_INTENSET_TXFE_Msk & (_UINT8_(value) << SERCOM_I2CS_INTENSET_TXFE_Pos)) /* Assignment of value for TXFE in the SERCOM_I2CS_INTENSET register */
#define SERCOM_I2CS_INTENSET_RXFF_Pos         _UINT8_(4)                                           /* (SERCOM_I2CS_INTENSET) Rx FIFO Full Interrupt Enable Position */
#define SERCOM_I2CS_INTENSET_RXFF_Msk         (_UINT8_(0x1) << SERCOM_I2CS_INTENSET_RXFF_Pos)      /* (SERCOM_I2CS_INTENSET) Rx FIFO Full Interrupt Enable Mask */
#define SERCOM_I2CS_INTENSET_RXFF(value)      (SERCOM_I2CS_INTENSET_RXFF_Msk & (_UINT8_(value) << SERCOM_I2CS_INTENSET_RXFF_Pos)) /* Assignment of value for RXFF in the SERCOM_I2CS_INTENSET register */
#define SERCOM_I2CS_INTENSET_ERROR_Pos        _UINT8_(7)                                           /* (SERCOM_I2CS_INTENSET) Combined Error Interrupt Enable Position */
#define SERCOM_I2CS_INTENSET_ERROR_Msk        (_UINT8_(0x1) << SERCOM_I2CS_INTENSET_ERROR_Pos)     /* (SERCOM_I2CS_INTENSET) Combined Error Interrupt Enable Mask */
#define SERCOM_I2CS_INTENSET_ERROR(value)     (SERCOM_I2CS_INTENSET_ERROR_Msk & (_UINT8_(value) << SERCOM_I2CS_INTENSET_ERROR_Pos)) /* Assignment of value for ERROR in the SERCOM_I2CS_INTENSET register */
#define SERCOM_I2CS_INTENSET_Msk              _UINT8_(0x9F)                                        /* (SERCOM_I2CS_INTENSET) Register Mask  */


