Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32CM5112GC00100_DFP/component/sercom.h
/* -------- SERCOM_USART_RXERRCNT : (SERCOM Offset: 0x20) ( R/ 8) USART Receive Error Count -------- */
#define SERCOM_USART_RXERRCNT_RESETVALUE      _UINT8_(0x00)                                        /*  (SERCOM_USART_RXERRCNT) USART Receive Error Count  Reset Value */

#define SERCOM_USART_RXERRCNT_Msk             _UINT8_(0x00)                                        /* (SERCOM_USART_RXERRCNT) Register Mask  */


/* -------- SERCOM_I2CS_LENGTH : (SERCOM Offset: 0x22) (R/W 16) I2CS Length -------- */
#define SERCOM_I2CS_LENGTH_RESETVALUE         _UINT16_(0x00)                                       /*  (SERCOM_I2CS_LENGTH) I2CS Length  Reset Value */

#define SERCOM_I2CS_LENGTH_LEN_Pos            _UINT16_(0)                                          /* (SERCOM_I2CS_LENGTH) Data Length Position */
#define SERCOM_I2CS_LENGTH_LEN_Msk            (_UINT16_(0xFF) << SERCOM_I2CS_LENGTH_LEN_Pos)       /* (SERCOM_I2CS_LENGTH) Data Length Mask */
#define SERCOM_I2CS_LENGTH_LEN(value)         (SERCOM_I2CS_LENGTH_LEN_Msk & (_UINT16_(value) << SERCOM_I2CS_LENGTH_LEN_Pos)) /* Assignment of value for LEN in the SERCOM_I2CS_LENGTH register */
#define SERCOM_I2CS_LENGTH_LENEN_Pos          _UINT16_(8)                                          /* (SERCOM_I2CS_LENGTH) Data Length Enable Position */
#define SERCOM_I2CS_LENGTH_LENEN_Msk          (_UINT16_(0x1) << SERCOM_I2CS_LENGTH_LENEN_Pos)      /* (SERCOM_I2CS_LENGTH) Data Length Enable Mask */
#define SERCOM_I2CS_LENGTH_LENEN(value)       (SERCOM_I2CS_LENGTH_LENEN_Msk & (_UINT16_(value) << SERCOM_I2CS_LENGTH_LENEN_Pos)) /* Assignment of value for LENEN in the SERCOM_I2CS_LENGTH register */
#define SERCOM_I2CS_LENGTH_Msk                _UINT16_(0x01FF)                                     /* (SERCOM_I2CS_LENGTH) Register Mask  */


/* -------- SERCOM_SPI_LENGTH : (SERCOM Offset: 0x22) (R/W 16) SPI Length -------- */
#define SERCOM_SPI_LENGTH_RESETVALUE          _UINT16_(0x00)                                       /*  (SERCOM_SPI_LENGTH) SPI Length  Reset Value */

#define SERCOM_SPI_LENGTH_LEN_Pos             _UINT16_(0)                                          /* (SERCOM_SPI_LENGTH) Data Length Position */
#define SERCOM_SPI_LENGTH_LEN_Msk             (_UINT16_(0xFF) << SERCOM_SPI_LENGTH_LEN_Pos)        /* (SERCOM_SPI_LENGTH) Data Length Mask */
#define SERCOM_SPI_LENGTH_LEN(value)          (SERCOM_SPI_LENGTH_LEN_Msk & (_UINT16_(value) << SERCOM_SPI_LENGTH_LEN_Pos)) /* Assignment of value for LEN in the SERCOM_SPI_LENGTH register */
#define SERCOM_SPI_LENGTH_LENEN_Pos           _UINT16_(8)                                          /* (SERCOM_SPI_LENGTH) Data Length Enable Position */
#define SERCOM_SPI_LENGTH_LENEN_Msk           (_UINT16_(0x1) << SERCOM_SPI_LENGTH_LENEN_Pos)       /* (SERCOM_SPI_LENGTH) Data Length Enable Mask */
#define SERCOM_SPI_LENGTH_LENEN(value)        (SERCOM_SPI_LENGTH_LENEN_Msk & (_UINT16_(value) << SERCOM_SPI_LENGTH_LENEN_Pos)) /* Assignment of value for LENEN in the SERCOM_SPI_LENGTH register */
#define SERCOM_SPI_LENGTH_Msk                 _UINT16_(0x01FF)                                     /* (SERCOM_SPI_LENGTH) Register Mask  */


/* -------- SERCOM_USART_LENGTH : (SERCOM Offset: 0x22) (R/W 16) USART Length -------- */
#define SERCOM_USART_LENGTH_RESETVALUE        _UINT16_(0x00)                                       /*  (SERCOM_USART_LENGTH) USART Length  Reset Value */

#define SERCOM_USART_LENGTH_LEN_Pos           _UINT16_(0)                                          /* (SERCOM_USART_LENGTH) Data Length Position */
#define SERCOM_USART_LENGTH_LEN_Msk           (_UINT16_(0xFF) << SERCOM_USART_LENGTH_LEN_Pos)      /* (SERCOM_USART_LENGTH) Data Length Mask */
#define SERCOM_USART_LENGTH_LEN(value)        (SERCOM_USART_LENGTH_LEN_Msk & (_UINT16_(value) << SERCOM_USART_LENGTH_LEN_Pos)) /* Assignment of value for LEN in the SERCOM_USART_LENGTH register */
#define SERCOM_USART_LENGTH_LENEN_Pos         _UINT16_(8)                                          /* (SERCOM_USART_LENGTH) Data Length Enable Position */
#define SERCOM_USART_LENGTH_LENEN_Msk         (_UINT16_(0x3) << SERCOM_USART_LENGTH_LENEN_Pos)     /* (SERCOM_USART_LENGTH) Data Length Enable Mask */
#define SERCOM_USART_LENGTH_LENEN(value)      (SERCOM_USART_LENGTH_LENEN_Msk & (_UINT16_(value) << SERCOM_USART_LENGTH_LENEN_Pos)) /* Assignment of value for LENEN in the SERCOM_USART_LENGTH register */
#define   SERCOM_USART_LENGTH_LENEN_DISABLE_Val _UINT16_(0x0)                                        /* (SERCOM_USART_LENGTH) Length counter is disabled  */
#define   SERCOM_USART_LENGTH_LENEN_TX_Val    _UINT16_(0x1)                                        /* (SERCOM_USART_LENGTH) Length counter is enabled for transmit  */
#define   SERCOM_USART_LENGTH_LENEN_RX_Val    _UINT16_(0x2)                                        /* (SERCOM_USART_LENGTH) Length counter is enabled for receive  */
#define SERCOM_USART_LENGTH_LENEN_DISABLE     (SERCOM_USART_LENGTH_LENEN_DISABLE_Val << SERCOM_USART_LENGTH_LENEN_Pos) /* (SERCOM_USART_LENGTH) Length counter is disabled Position */
#define SERCOM_USART_LENGTH_LENEN_TX          (SERCOM_USART_LENGTH_LENEN_TX_Val << SERCOM_USART_LENGTH_LENEN_Pos) /* (SERCOM_USART_LENGTH) Length counter is enabled for transmit Position */
#define SERCOM_USART_LENGTH_LENEN_RX          (SERCOM_USART_LENGTH_LENEN_RX_Val << SERCOM_USART_LENGTH_LENEN_Pos) /* (SERCOM_USART_LENGTH) Length counter is enabled for receive Position */
#define SERCOM_USART_LENGTH_Msk               _UINT16_(0x03FF)                                     /* (SERCOM_USART_LENGTH) Register Mask  */


/* -------- SERCOM_I2CM_ADDR : (SERCOM Offset: 0x24) (R/W 32) I2CM Address -------- */
#define SERCOM_I2CM_ADDR_RESETVALUE           _UINT32_(0x00)                                       /*  (SERCOM_I2CM_ADDR) I2CM Address  Reset Value */

#define SERCOM_I2CM_ADDR_ADDR_Pos             _UINT32_(0)                                          /* (SERCOM_I2CM_ADDR) Address Value Position */
#define SERCOM_I2CM_ADDR_ADDR_Msk             (_UINT32_(0x7FF) << SERCOM_I2CM_ADDR_ADDR_Pos)       /* (SERCOM_I2CM_ADDR) Address Value Mask */
#define SERCOM_I2CM_ADDR_ADDR(value)          (SERCOM_I2CM_ADDR_ADDR_Msk & (_UINT32_(value) << SERCOM_I2CM_ADDR_ADDR_Pos)) /* Assignment of value for ADDR in the SERCOM_I2CM_ADDR register */
#define SERCOM_I2CM_ADDR_LENEN_Pos            _UINT32_(13)                                         /* (SERCOM_I2CM_ADDR) Length Enable Position */
#define SERCOM_I2CM_ADDR_LENEN_Msk            (_UINT32_(0x1) << SERCOM_I2CM_ADDR_LENEN_Pos)        /* (SERCOM_I2CM_ADDR) Length Enable Mask */
#define SERCOM_I2CM_ADDR_LENEN(value)         (SERCOM_I2CM_ADDR_LENEN_Msk & (_UINT32_(value) << SERCOM_I2CM_ADDR_LENEN_Pos)) /* Assignment of value for LENEN in the SERCOM_I2CM_ADDR register */
#define SERCOM_I2CM_ADDR_HS_Pos               _UINT32_(14)                                         /* (SERCOM_I2CM_ADDR) High Speed Mode Position */
#define SERCOM_I2CM_ADDR_HS_Msk               (_UINT32_(0x1) << SERCOM_I2CM_ADDR_HS_Pos)           /* (SERCOM_I2CM_ADDR) High Speed Mode Mask */
#define SERCOM_I2CM_ADDR_HS(value)            (SERCOM_I2CM_ADDR_HS_Msk & (_UINT32_(value) << SERCOM_I2CM_ADDR_HS_Pos)) /* Assignment of value for HS in the SERCOM_I2CM_ADDR register */
#define SERCOM_I2CM_ADDR_TENBITEN_Pos         _UINT32_(15)                                         /* (SERCOM_I2CM_ADDR) Ten Bit Addressing Enable Position */
#define SERCOM_I2CM_ADDR_TENBITEN_Msk         (_UINT32_(0x1) << SERCOM_I2CM_ADDR_TENBITEN_Pos)     /* (SERCOM_I2CM_ADDR) Ten Bit Addressing Enable Mask */
#define SERCOM_I2CM_ADDR_TENBITEN(value)      (SERCOM_I2CM_ADDR_TENBITEN_Msk & (_UINT32_(value) << SERCOM_I2CM_ADDR_TENBITEN_Pos)) /* Assignment of value for TENBITEN in the SERCOM_I2CM_ADDR register */
#define SERCOM_I2CM_ADDR_LEN_Pos              _UINT32_(16)                                         /* (SERCOM_I2CM_ADDR) Length Position */
#define SERCOM_I2CM_ADDR_LEN_Msk              (_UINT32_(0xFF) << SERCOM_I2CM_ADDR_LEN_Pos)         /* (SERCOM_I2CM_ADDR) Length Mask */
#define SERCOM_I2CM_ADDR_LEN(value)           (SERCOM_I2CM_ADDR_LEN_Msk & (_UINT32_(value) << SERCOM_I2CM_ADDR_LEN_Pos)) /* Assignment of value for LEN in the SERCOM_I2CM_ADDR register */
#define SERCOM_I2CM_ADDR_Msk                  _UINT32_(0x00FFE7FF)                                 /* (SERCOM_I2CM_ADDR) Register Mask  */


/* -------- SERCOM_I2CS_ADDR : (SERCOM Offset: 0x24) (R/W 32) I2CS Address -------- */
#define SERCOM_I2CS_ADDR_RESETVALUE           _UINT32_(0x00)                                       /*  (SERCOM_I2CS_ADDR) I2CS Address  Reset Value */

#define SERCOM_I2CS_ADDR_GENCEN_Pos           _UINT32_(0)                                          /* (SERCOM_I2CS_ADDR) General Call Address Enable Position */
#define SERCOM_I2CS_ADDR_GENCEN_Msk           (_UINT32_(0x1) << SERCOM_I2CS_ADDR_GENCEN_Pos)       /* (SERCOM_I2CS_ADDR) General Call Address Enable Mask */
#define SERCOM_I2CS_ADDR_GENCEN(value)        (SERCOM_I2CS_ADDR_GENCEN_Msk & (_UINT32_(value) << SERCOM_I2CS_ADDR_GENCEN_Pos)) /* Assignment of value for GENCEN in the SERCOM_I2CS_ADDR register */
#define SERCOM_I2CS_ADDR_ADDR_Pos             _UINT32_(1)                                          /* (SERCOM_I2CS_ADDR) Address Value Position */
#define SERCOM_I2CS_ADDR_ADDR_Msk             (_UINT32_(0x3FF) << SERCOM_I2CS_ADDR_ADDR_Pos)       /* (SERCOM_I2CS_ADDR) Address Value Mask */
#define SERCOM_I2CS_ADDR_ADDR(value)          (SERCOM_I2CS_ADDR_ADDR_Msk & (_UINT32_(value) << SERCOM_I2CS_ADDR_ADDR_Pos)) /* Assignment of value for ADDR in the SERCOM_I2CS_ADDR register */
#define SERCOM_I2CS_ADDR_TENBITEN_Pos         _UINT32_(15)                                         /* (SERCOM_I2CS_ADDR) Ten Bit Addressing Enable Position */
#define SERCOM_I2CS_ADDR_TENBITEN_Msk         (_UINT32_(0x1) << SERCOM_I2CS_ADDR_TENBITEN_Pos)     /* (SERCOM_I2CS_ADDR) Ten Bit Addressing Enable Mask */
#define SERCOM_I2CS_ADDR_TENBITEN(value)      (SERCOM_I2CS_ADDR_TENBITEN_Msk & (_UINT32_(value) << SERCOM_I2CS_ADDR_TENBITEN_Pos)) /* Assignment of value for TENBITEN in the SERCOM_I2CS_ADDR register */
#define SERCOM_I2CS_ADDR_ADDRMASK_Pos         _UINT32_(17)                                         /* (SERCOM_I2CS_ADDR) Address Mask Position */
#define SERCOM_I2CS_ADDR_ADDRMASK_Msk         (_UINT32_(0x3FF) << SERCOM_I2CS_ADDR_ADDRMASK_Pos)   /* (SERCOM_I2CS_ADDR) Address Mask Mask */
#define SERCOM_I2CS_ADDR_ADDRMASK(value)      (SERCOM_I2CS_ADDR_ADDRMASK_Msk & (_UINT32_(value) << SERCOM_I2CS_ADDR_ADDRMASK_Pos)) /* Assignment of value for ADDRMASK in the SERCOM_I2CS_ADDR register */
#define SERCOM_I2CS_ADDR_Msk                  _UINT32_(0x07FE87FF)                                 /* (SERCOM_I2CS_ADDR) Register Mask  */


/* -------- SERCOM_SPI_ADDR : (SERCOM Offset: 0x24) (R/W 32) SPI Address -------- */
#define SERCOM_SPI_ADDR_RESETVALUE            _UINT32_(0x00)                                       /*  (SERCOM_SPI_ADDR) SPI Address  Reset Value */

