Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32CM5112GC00100_DFP/component/sercom.h
#define SERCOM_I2CM_FIFOSPACE_TXSPACE_Pos     _UINT16_(0)                                          /* (SERCOM_I2CM_FIFOSPACE) Tx FIFO Empty Space Position */
#define SERCOM_I2CM_FIFOSPACE_TXSPACE_Msk     (_UINT16_(0x1F) << SERCOM_I2CM_FIFOSPACE_TXSPACE_Pos) /* (SERCOM_I2CM_FIFOSPACE) Tx FIFO Empty Space Mask */
#define SERCOM_I2CM_FIFOSPACE_TXSPACE(value)  (SERCOM_I2CM_FIFOSPACE_TXSPACE_Msk & (_UINT16_(value) << SERCOM_I2CM_FIFOSPACE_TXSPACE_Pos)) /* Assignment of value for TXSPACE in the SERCOM_I2CM_FIFOSPACE register */
#define SERCOM_I2CM_FIFOSPACE_RXSPACE_Pos     _UINT16_(8)                                          /* (SERCOM_I2CM_FIFOSPACE) Rx FIFO Filled Space Position */
#define SERCOM_I2CM_FIFOSPACE_RXSPACE_Msk     (_UINT16_(0x1F) << SERCOM_I2CM_FIFOSPACE_RXSPACE_Pos) /* (SERCOM_I2CM_FIFOSPACE) Rx FIFO Filled Space Mask */
#define SERCOM_I2CM_FIFOSPACE_RXSPACE(value)  (SERCOM_I2CM_FIFOSPACE_RXSPACE_Msk & (_UINT16_(value) << SERCOM_I2CM_FIFOSPACE_RXSPACE_Pos)) /* Assignment of value for RXSPACE in the SERCOM_I2CM_FIFOSPACE register */
#define SERCOM_I2CM_FIFOSPACE_Msk             _UINT16_(0x1F1F)                                     /* (SERCOM_I2CM_FIFOSPACE) Register Mask  */


/* -------- SERCOM_I2CS_FIFOSPACE : (SERCOM Offset: 0x34) ( R/ 16) I2CS FIFO Space -------- */
#define SERCOM_I2CS_FIFOSPACE_RESETVALUE      _UINT16_(0x00)                                       /*  (SERCOM_I2CS_FIFOSPACE) I2CS FIFO Space  Reset Value */

#define SERCOM_I2CS_FIFOSPACE_TXSPACE_Pos     _UINT16_(0)                                          /* (SERCOM_I2CS_FIFOSPACE) Tx FIFO Empty Space Position */
#define SERCOM_I2CS_FIFOSPACE_TXSPACE_Msk     (_UINT16_(0x1F) << SERCOM_I2CS_FIFOSPACE_TXSPACE_Pos) /* (SERCOM_I2CS_FIFOSPACE) Tx FIFO Empty Space Mask */
#define SERCOM_I2CS_FIFOSPACE_TXSPACE(value)  (SERCOM_I2CS_FIFOSPACE_TXSPACE_Msk & (_UINT16_(value) << SERCOM_I2CS_FIFOSPACE_TXSPACE_Pos)) /* Assignment of value for TXSPACE in the SERCOM_I2CS_FIFOSPACE register */
#define SERCOM_I2CS_FIFOSPACE_RXSPACE_Pos     _UINT16_(8)                                          /* (SERCOM_I2CS_FIFOSPACE) Rx FIFO Filled Space Position */
#define SERCOM_I2CS_FIFOSPACE_RXSPACE_Msk     (_UINT16_(0x1F) << SERCOM_I2CS_FIFOSPACE_RXSPACE_Pos) /* (SERCOM_I2CS_FIFOSPACE) Rx FIFO Filled Space Mask */
#define SERCOM_I2CS_FIFOSPACE_RXSPACE(value)  (SERCOM_I2CS_FIFOSPACE_RXSPACE_Msk & (_UINT16_(value) << SERCOM_I2CS_FIFOSPACE_RXSPACE_Pos)) /* Assignment of value for RXSPACE in the SERCOM_I2CS_FIFOSPACE register */
#define SERCOM_I2CS_FIFOSPACE_Msk             _UINT16_(0x1F1F)                                     /* (SERCOM_I2CS_FIFOSPACE) Register Mask  */


/* -------- SERCOM_SPI_FIFOSPACE : (SERCOM Offset: 0x34) ( R/ 16) SPI FIFO Space -------- */
#define SERCOM_SPI_FIFOSPACE_RESETVALUE       _UINT16_(0x00)                                       /*  (SERCOM_SPI_FIFOSPACE) SPI FIFO Space  Reset Value */

#define SERCOM_SPI_FIFOSPACE_TXSPACE_Pos      _UINT16_(0)                                          /* (SERCOM_SPI_FIFOSPACE) Tx FIFO Empty Space Position */
#define SERCOM_SPI_FIFOSPACE_TXSPACE_Msk      (_UINT16_(0x1F) << SERCOM_SPI_FIFOSPACE_TXSPACE_Pos) /* (SERCOM_SPI_FIFOSPACE) Tx FIFO Empty Space Mask */
#define SERCOM_SPI_FIFOSPACE_TXSPACE(value)   (SERCOM_SPI_FIFOSPACE_TXSPACE_Msk & (_UINT16_(value) << SERCOM_SPI_FIFOSPACE_TXSPACE_Pos)) /* Assignment of value for TXSPACE in the SERCOM_SPI_FIFOSPACE register */
#define SERCOM_SPI_FIFOSPACE_RXSPACE_Pos      _UINT16_(8)                                          /* (SERCOM_SPI_FIFOSPACE) Rx FIFO Filled Space Position */
#define SERCOM_SPI_FIFOSPACE_RXSPACE_Msk      (_UINT16_(0x1F) << SERCOM_SPI_FIFOSPACE_RXSPACE_Pos) /* (SERCOM_SPI_FIFOSPACE) Rx FIFO Filled Space Mask */
#define SERCOM_SPI_FIFOSPACE_RXSPACE(value)   (SERCOM_SPI_FIFOSPACE_RXSPACE_Msk & (_UINT16_(value) << SERCOM_SPI_FIFOSPACE_RXSPACE_Pos)) /* Assignment of value for RXSPACE in the SERCOM_SPI_FIFOSPACE register */
#define SERCOM_SPI_FIFOSPACE_Msk              _UINT16_(0x1F1F)                                     /* (SERCOM_SPI_FIFOSPACE) Register Mask  */


/* -------- SERCOM_USART_FIFOSPACE : (SERCOM Offset: 0x34) ( R/ 16) USART FIFO Space -------- */
#define SERCOM_USART_FIFOSPACE_RESETVALUE     _UINT16_(0x00)                                       /*  (SERCOM_USART_FIFOSPACE) USART FIFO Space  Reset Value */

#define SERCOM_USART_FIFOSPACE_TXSPACE_Pos    _UINT16_(0)                                          /* (SERCOM_USART_FIFOSPACE) Tx FIFO Empty Space Position */
#define SERCOM_USART_FIFOSPACE_TXSPACE_Msk    (_UINT16_(0x1F) << SERCOM_USART_FIFOSPACE_TXSPACE_Pos) /* (SERCOM_USART_FIFOSPACE) Tx FIFO Empty Space Mask */
#define SERCOM_USART_FIFOSPACE_TXSPACE(value) (SERCOM_USART_FIFOSPACE_TXSPACE_Msk & (_UINT16_(value) << SERCOM_USART_FIFOSPACE_TXSPACE_Pos)) /* Assignment of value for TXSPACE in the SERCOM_USART_FIFOSPACE register */
#define SERCOM_USART_FIFOSPACE_RXSPACE_Pos    _UINT16_(8)                                          /* (SERCOM_USART_FIFOSPACE) Rx FIFO Filled Space Position */
#define SERCOM_USART_FIFOSPACE_RXSPACE_Msk    (_UINT16_(0x1F) << SERCOM_USART_FIFOSPACE_RXSPACE_Pos) /* (SERCOM_USART_FIFOSPACE) Rx FIFO Filled Space Mask */
#define SERCOM_USART_FIFOSPACE_RXSPACE(value) (SERCOM_USART_FIFOSPACE_RXSPACE_Msk & (_UINT16_(value) << SERCOM_USART_FIFOSPACE_RXSPACE_Pos)) /* Assignment of value for RXSPACE in the SERCOM_USART_FIFOSPACE register */
#define SERCOM_USART_FIFOSPACE_Msk            _UINT16_(0x1F1F)                                     /* (SERCOM_USART_FIFOSPACE) Register Mask  */


/* -------- SERCOM_I2CM_FIFOPTR : (SERCOM Offset: 0x36) (R/W 16) I2CM FIFO CPU Pointers -------- */
#define SERCOM_I2CM_FIFOPTR_RESETVALUE        _UINT16_(0x00)                                       /*  (SERCOM_I2CM_FIFOPTR) I2CM FIFO CPU Pointers  Reset Value */

#define SERCOM_I2CM_FIFOPTR_CPUWRPTR_Pos      _UINT16_(0)                                          /* (SERCOM_I2CM_FIFOPTR) CPU FIFO Write Pointer Position */
#define SERCOM_I2CM_FIFOPTR_CPUWRPTR_Msk      (_UINT16_(0xF) << SERCOM_I2CM_FIFOPTR_CPUWRPTR_Pos)  /* (SERCOM_I2CM_FIFOPTR) CPU FIFO Write Pointer Mask */
#define SERCOM_I2CM_FIFOPTR_CPUWRPTR(value)   (SERCOM_I2CM_FIFOPTR_CPUWRPTR_Msk & (_UINT16_(value) << SERCOM_I2CM_FIFOPTR_CPUWRPTR_Pos)) /* Assignment of value for CPUWRPTR in the SERCOM_I2CM_FIFOPTR register */
#define SERCOM_I2CM_FIFOPTR_CPURDPTR_Pos      _UINT16_(8)                                          /* (SERCOM_I2CM_FIFOPTR) CPU FIFO Read Pointer Position */
#define SERCOM_I2CM_FIFOPTR_CPURDPTR_Msk      (_UINT16_(0xF) << SERCOM_I2CM_FIFOPTR_CPURDPTR_Pos)  /* (SERCOM_I2CM_FIFOPTR) CPU FIFO Read Pointer Mask */
#define SERCOM_I2CM_FIFOPTR_CPURDPTR(value)   (SERCOM_I2CM_FIFOPTR_CPURDPTR_Msk & (_UINT16_(value) << SERCOM_I2CM_FIFOPTR_CPURDPTR_Pos)) /* Assignment of value for CPURDPTR in the SERCOM_I2CM_FIFOPTR register */
#define SERCOM_I2CM_FIFOPTR_Msk               _UINT16_(0x0F0F)                                     /* (SERCOM_I2CM_FIFOPTR) Register Mask  */


/* -------- SERCOM_I2CS_FIFOPTR : (SERCOM Offset: 0x36) (R/W 16) I2CS FIFO CPU Pointers -------- */
#define SERCOM_I2CS_FIFOPTR_RESETVALUE        _UINT16_(0x00)                                       /*  (SERCOM_I2CS_FIFOPTR) I2CS FIFO CPU Pointers  Reset Value */

#define SERCOM_I2CS_FIFOPTR_CPUWRPTR_Pos      _UINT16_(0)                                          /* (SERCOM_I2CS_FIFOPTR) CPU FIFO Write Pointer Position */
#define SERCOM_I2CS_FIFOPTR_CPUWRPTR_Msk      (_UINT16_(0xF) << SERCOM_I2CS_FIFOPTR_CPUWRPTR_Pos)  /* (SERCOM_I2CS_FIFOPTR) CPU FIFO Write Pointer Mask */
#define SERCOM_I2CS_FIFOPTR_CPUWRPTR(value)   (SERCOM_I2CS_FIFOPTR_CPUWRPTR_Msk & (_UINT16_(value) << SERCOM_I2CS_FIFOPTR_CPUWRPTR_Pos)) /* Assignment of value for CPUWRPTR in the SERCOM_I2CS_FIFOPTR register */
#define SERCOM_I2CS_FIFOPTR_CPURDPTR_Pos      _UINT16_(8)                                          /* (SERCOM_I2CS_FIFOPTR) CPU FIFO Read Pointer Position */
#define SERCOM_I2CS_FIFOPTR_CPURDPTR_Msk      (_UINT16_(0xF) << SERCOM_I2CS_FIFOPTR_CPURDPTR_Pos)  /* (SERCOM_I2CS_FIFOPTR) CPU FIFO Read Pointer Mask */
#define SERCOM_I2CS_FIFOPTR_CPURDPTR(value)   (SERCOM_I2CS_FIFOPTR_CPURDPTR_Msk & (_UINT16_(value) << SERCOM_I2CS_FIFOPTR_CPURDPTR_Pos)) /* Assignment of value for CPURDPTR in the SERCOM_I2CS_FIFOPTR register */
#define SERCOM_I2CS_FIFOPTR_Msk               _UINT16_(0x0F0F)                                     /* (SERCOM_I2CS_FIFOPTR) Register Mask  */


/* -------- SERCOM_SPI_FIFOPTR : (SERCOM Offset: 0x36) (R/W 16) SPI FIFO CPU Pointers -------- */
#define SERCOM_SPI_FIFOPTR_RESETVALUE         _UINT16_(0x00)                                       /*  (SERCOM_SPI_FIFOPTR) SPI FIFO CPU Pointers  Reset Value */

#define SERCOM_SPI_FIFOPTR_CPUWRPTR_Pos       _UINT16_(0)                                          /* (SERCOM_SPI_FIFOPTR) CPU FIFO Write Pointer Position */
#define SERCOM_SPI_FIFOPTR_CPUWRPTR_Msk       (_UINT16_(0xF) << SERCOM_SPI_FIFOPTR_CPUWRPTR_Pos)   /* (SERCOM_SPI_FIFOPTR) CPU FIFO Write Pointer Mask */
#define SERCOM_SPI_FIFOPTR_CPUWRPTR(value)    (SERCOM_SPI_FIFOPTR_CPUWRPTR_Msk & (_UINT16_(value) << SERCOM_SPI_FIFOPTR_CPUWRPTR_Pos)) /* Assignment of value for CPUWRPTR in the SERCOM_SPI_FIFOPTR register */
#define SERCOM_SPI_FIFOPTR_CPURDPTR_Pos       _UINT16_(8)                                          /* (SERCOM_SPI_FIFOPTR) CPU FIFO Read Pointer Position */
#define SERCOM_SPI_FIFOPTR_CPURDPTR_Msk       (_UINT16_(0xF) << SERCOM_SPI_FIFOPTR_CPURDPTR_Pos)   /* (SERCOM_SPI_FIFOPTR) CPU FIFO Read Pointer Mask */
#define SERCOM_SPI_FIFOPTR_CPURDPTR(value)    (SERCOM_SPI_FIFOPTR_CPURDPTR_Msk & (_UINT16_(value) << SERCOM_SPI_FIFOPTR_CPURDPTR_Pos)) /* Assignment of value for CPURDPTR in the SERCOM_SPI_FIFOPTR register */
#define SERCOM_SPI_FIFOPTR_Msk                _UINT16_(0x0F0F)                                     /* (SERCOM_SPI_FIFOPTR) Register Mask  */


/* -------- SERCOM_USART_FIFOPTR : (SERCOM Offset: 0x36) (R/W 16) USART FIFO CPU Pointers -------- */
#define SERCOM_USART_FIFOPTR_RESETVALUE       _UINT16_(0x00)                                       /*  (SERCOM_USART_FIFOPTR) USART FIFO CPU Pointers  Reset Value */

#define SERCOM_USART_FIFOPTR_CPUWRPTR_Pos     _UINT16_(0)                                          /* (SERCOM_USART_FIFOPTR) CPU FIFO Write Pointer Position */
#define SERCOM_USART_FIFOPTR_CPUWRPTR_Msk     (_UINT16_(0xF) << SERCOM_USART_FIFOPTR_CPUWRPTR_Pos) /* (SERCOM_USART_FIFOPTR) CPU FIFO Write Pointer Mask */
#define SERCOM_USART_FIFOPTR_CPUWRPTR(value)  (SERCOM_USART_FIFOPTR_CPUWRPTR_Msk & (_UINT16_(value) << SERCOM_USART_FIFOPTR_CPUWRPTR_Pos)) /* Assignment of value for CPUWRPTR in the SERCOM_USART_FIFOPTR register */
#define SERCOM_USART_FIFOPTR_CPURDPTR_Pos     _UINT16_(8)                                          /* (SERCOM_USART_FIFOPTR) CPU FIFO Read Pointer Position */
#define SERCOM_USART_FIFOPTR_CPURDPTR_Msk     (_UINT16_(0xF) << SERCOM_USART_FIFOPTR_CPURDPTR_Pos) /* (SERCOM_USART_FIFOPTR) CPU FIFO Read Pointer Mask */
#define SERCOM_USART_FIFOPTR_CPURDPTR(value)  (SERCOM_USART_FIFOPTR_CPURDPTR_Msk & (_UINT16_(value) << SERCOM_USART_FIFOPTR_CPURDPTR_Pos)) /* Assignment of value for CPURDPTR in the SERCOM_USART_FIFOPTR register */
#define SERCOM_USART_FIFOPTR_Msk              _UINT16_(0x0F0F)                                     /* (SERCOM_USART_FIFOPTR) Register Mask  */


/* SERCOM register offsets definitions */
#define SERCOM_I2CM_CTRLA_REG_OFST     _UINT32_(0x00)      /* (SERCOM_I2CM_CTRLA) I2CM Control A Offset */
#define SERCOM_I2CS_CTRLA_REG_OFST     _UINT32_(0x00)      /* (SERCOM_I2CS_CTRLA) I2CS Control A Offset */
#define SERCOM_SPI_CTRLA_REG_OFST      _UINT32_(0x00)      /* (SERCOM_SPI_CTRLA) SPI Control A Offset */
#define SERCOM_USART_CTRLA_REG_OFST    _UINT32_(0x00)      /* (SERCOM_USART_CTRLA) USART Control A Offset */
#define SERCOM_I2CM_CTRLB_REG_OFST     _UINT32_(0x04)      /* (SERCOM_I2CM_CTRLB) I2CM Control B Offset */
#define SERCOM_I2CS_CTRLB_REG_OFST     _UINT32_(0x04)      /* (SERCOM_I2CS_CTRLB) I2CS Control B Offset */
#define SERCOM_SPI_CTRLB_REG_OFST      _UINT32_(0x04)      /* (SERCOM_SPI_CTRLB) SPI Control B Offset */
#define SERCOM_USART_CTRLB_REG_OFST    _UINT32_(0x04)      /* (SERCOM_USART_CTRLB) USART Control B Offset */
#define SERCOM_I2CM_CTRLC_REG_OFST     _UINT32_(0x08)      /* (SERCOM_I2CM_CTRLC) I2CM Control C Offset */
#define SERCOM_I2CS_CTRLC_REG_OFST     _UINT32_(0x08)      /* (SERCOM_I2CS_CTRLC) I2CS Control C Offset */
#define SERCOM_SPI_CTRLC_REG_OFST      _UINT32_(0x08)      /* (SERCOM_SPI_CTRLC) SPI Control C Offset */
#define SERCOM_USART_CTRLC_REG_OFST    _UINT32_(0x08)      /* (SERCOM_USART_CTRLC) USART Control C Offset */
#define SERCOM_I2CM_BAUD_REG_OFST      _UINT32_(0x0C)      /* (SERCOM_I2CM_BAUD) I2CM Baud Rate Offset */
#define SERCOM_SPI_BAUD_REG_OFST       _UINT32_(0x0C)      /* (SERCOM_SPI_BAUD) SPI Baud Rate Offset */
#define SERCOM_USART_BAUD_REG_OFST     _UINT32_(0x0C)      /* (SERCOM_USART_BAUD) USART Baud Rate Offset */
#define SERCOM_USART_RXPL_REG_OFST     _UINT32_(0x0E)      /* (SERCOM_USART_RXPL) USART Receive Pulse Length Offset */
#define SERCOM_I2CM_INTENCLR_REG_OFST  _UINT32_(0x14)      /* (SERCOM_I2CM_INTENCLR) I2CM Interrupt Enable Clear Offset */
#define SERCOM_I2CS_INTENCLR_REG_OFST  _UINT32_(0x14)      /* (SERCOM_I2CS_INTENCLR) I2CS Interrupt Enable Clear Offset */
#define SERCOM_SPI_INTENCLR_REG_OFST   _UINT32_(0x14)      /* (SERCOM_SPI_INTENCLR) SPI Interrupt Enable Clear Offset */
#define SERCOM_USART_INTENCLR_REG_OFST _UINT32_(0x14)      /* (SERCOM_USART_INTENCLR) USART Interrupt Enable Clear Offset */
#define SERCOM_I2CM_INTENSET_REG_OFST  _UINT32_(0x16)      /* (SERCOM_I2CM_INTENSET) I2CM Interrupt Enable Set Offset */
#define SERCOM_I2CS_INTENSET_REG_OFST  _UINT32_(0x16)      /* (SERCOM_I2CS_INTENSET) I2CS Interrupt Enable Set Offset */
#define SERCOM_SPI_INTENSET_REG_OFST   _UINT32_(0x16)      /* (SERCOM_SPI_INTENSET) SPI Interrupt Enable Set Offset */
#define SERCOM_USART_INTENSET_REG_OFST _UINT32_(0x16)      /* (SERCOM_USART_INTENSET) USART Interrupt Enable Set Offset */
#define SERCOM_I2CM_INTFLAG_REG_OFST   _UINT32_(0x18)      /* (SERCOM_I2CM_INTFLAG) I2CM Interrupt Flag Status and Clear Offset */
#define SERCOM_I2CS_INTFLAG_REG_OFST   _UINT32_(0x18)      /* (SERCOM_I2CS_INTFLAG) I2CS Interrupt Flag Status and Clear Offset */
#define SERCOM_SPI_INTFLAG_REG_OFST    _UINT32_(0x18)      /* (SERCOM_SPI_INTFLAG) SPI Interrupt Flag Status and Clear Offset */
#define SERCOM_USART_INTFLAG_REG_OFST  _UINT32_(0x18)      /* (SERCOM_USART_INTFLAG) USART Interrupt Flag Status and Clear Offset */
#define SERCOM_I2CM_STATUS_REG_OFST    _UINT32_(0x1A)      /* (SERCOM_I2CM_STATUS) I2CM Status Offset */
#define SERCOM_I2CS_STATUS_REG_OFST    _UINT32_(0x1A)      /* (SERCOM_I2CS_STATUS) I2CS Status Offset */
#define SERCOM_SPI_STATUS_REG_OFST     _UINT32_(0x1A)      /* (SERCOM_SPI_STATUS) SPI Status Offset */
#define SERCOM_USART_STATUS_REG_OFST   _UINT32_(0x1A)      /* (SERCOM_USART_STATUS) USART Status Offset */
#define SERCOM_I2CM_SYNCBUSY_REG_OFST  _UINT32_(0x1C)      /* (SERCOM_I2CM_SYNCBUSY) I2CM Synchronization Busy Offset */
#define SERCOM_I2CS_SYNCBUSY_REG_OFST  _UINT32_(0x1C)      /* (SERCOM_I2CS_SYNCBUSY) I2CS Synchronization Busy Offset */
#define SERCOM_SPI_SYNCBUSY_REG_OFST   _UINT32_(0x1C)      /* (SERCOM_SPI_SYNCBUSY) SPI Synchronization Busy Offset */
#define SERCOM_USART_SYNCBUSY_REG_OFST _UINT32_(0x1C)      /* (SERCOM_USART_SYNCBUSY) USART Synchronization Busy Offset */
#define SERCOM_USART_RXERRCNT_REG_OFST _UINT32_(0x20)      /* (SERCOM_USART_RXERRCNT) USART Receive Error Count Offset */
#define SERCOM_I2CS_LENGTH_REG_OFST    _UINT32_(0x22)      /* (SERCOM_I2CS_LENGTH) I2CS Length Offset */
#define SERCOM_SPI_LENGTH_REG_OFST     _UINT32_(0x22)      /* (SERCOM_SPI_LENGTH) SPI Length Offset */
#define SERCOM_USART_LENGTH_REG_OFST   _UINT32_(0x22)      /* (SERCOM_USART_LENGTH) USART Length Offset */
#define SERCOM_I2CM_ADDR_REG_OFST      _UINT32_(0x24)      /* (SERCOM_I2CM_ADDR) I2CM Address Offset */
#define SERCOM_I2CS_ADDR_REG_OFST      _UINT32_(0x24)      /* (SERCOM_I2CS_ADDR) I2CS Address Offset */
#define SERCOM_SPI_ADDR_REG_OFST       _UINT32_(0x24)      /* (SERCOM_SPI_ADDR) SPI Address Offset */
#define SERCOM_I2CM_DATA_REG_OFST      _UINT32_(0x28)      /* (SERCOM_I2CM_DATA) I2CM Data Offset */
#define SERCOM_I2CS_DATA_REG_OFST      _UINT32_(0x28)      /* (SERCOM_I2CS_DATA) I2CS Data Offset */
#define SERCOM_SPI_DATA_REG_OFST       _UINT32_(0x28)      /* (SERCOM_SPI_DATA) SPI Data Offset */
#define SERCOM_USART_DATA_REG_OFST     _UINT32_(0x28)      /* (SERCOM_USART_DATA) USART Data Offset */
#define SERCOM_I2CM_DBGCTRL_REG_OFST   _UINT32_(0x30)      /* (SERCOM_I2CM_DBGCTRL) I2CM Debug Control Offset */
#define SERCOM_SPI_DBGCTRL_REG_OFST    _UINT32_(0x30)      /* (SERCOM_SPI_DBGCTRL) SPI Debug Control Offset */
#define SERCOM_USART_DBGCTRL_REG_OFST  _UINT32_(0x30)      /* (SERCOM_USART_DBGCTRL) USART Debug Control Offset */
#define SERCOM_I2CM_FIFOSPACE_REG_OFST _UINT32_(0x34)      /* (SERCOM_I2CM_FIFOSPACE) I2CM FIFO Space Offset */
#define SERCOM_I2CS_FIFOSPACE_REG_OFST _UINT32_(0x34)      /* (SERCOM_I2CS_FIFOSPACE) I2CS FIFO Space Offset */
#define SERCOM_SPI_FIFOSPACE_REG_OFST  _UINT32_(0x34)      /* (SERCOM_SPI_FIFOSPACE) SPI FIFO Space Offset */
#define SERCOM_USART_FIFOSPACE_REG_OFST _UINT32_(0x34)      /* (SERCOM_USART_FIFOSPACE) USART FIFO Space Offset */
#define SERCOM_I2CM_FIFOPTR_REG_OFST   _UINT32_(0x36)      /* (SERCOM_I2CM_FIFOPTR) I2CM FIFO CPU Pointers Offset */
#define SERCOM_I2CS_FIFOPTR_REG_OFST   _UINT32_(0x36)      /* (SERCOM_I2CS_FIFOPTR) I2CS FIFO CPU Pointers Offset */
#define SERCOM_SPI_FIFOPTR_REG_OFST    _UINT32_(0x36)      /* (SERCOM_SPI_FIFOPTR) SPI FIFO CPU Pointers Offset */
#define SERCOM_USART_FIFOPTR_REG_OFST  _UINT32_(0x36)      /* (SERCOM_USART_FIFOPTR) USART FIFO CPU Pointers Offset */

